<template>
  <main class="aggrement">
    <Header title="充值协议"></Header>
    <div class="body">
      <p>一、协议适用范围</p>
      <p>1. 本协议是甲乙双方就甲方在乙方小程序内进行充值、使用充值款项及乙方提供相关服务所订立的书面协议，是双方权利义务的核心依据。</p>
      <p>2.
        甲方通过小程序注册账号、点击“同意充值”“确认支付”等操作，即视为已仔细阅读、充分理解并自愿接受本协议全部条款，以及乙方发布的小程序用户协议、隐私政策、充值规则等相关附属规则，本协议自甲方完成首次充值操作之日起生效，对双方具有法律约束力。
      </p>
      <p>3. 本协议未尽事宜，可参照乙方小程序内发布的相关规则；若本协议与乙方发布的相关规则存在冲突，以本协议为准；若本协议内容与相关法律法规相抵触，以法律法规为准。</p>
      <p>二、充值相关约定</p>
      <p>（一）充值定义与用途</p>
      <p>1. 本协议所称“充值”，指甲方通过乙方小程序提供的支付渠道（微信支付、支付宝等），向其小程序账号内注入资金，用于兑换小程序内虚拟货币、购买服务、消费商品或享受其他增值服务的行为。</p>
      <p>2. 甲方充值的款项仅可用于乙方小程序内指定的消费场景，不得用于非法用途，不得转让、赠与、折现或用于本协议约定以外的其他用途，乙方有权对充值款项的使用范围进行限制和规范。</p>
      <p>（二）充值流程与金额</p>
      <p>1. 甲方充值时，需登录本人已完成实名认证的小程序账号，选择充值金额、支付方式，按照小程序提示完成支付操作，支付成功后，充值款项将即时到账至甲方小程序账号（因支付渠道延迟、系统故障等不可抗力因素导致到账延迟的除外）。
      </p>
      <p>2. 乙方小程序提供多种充值档位（具体以小程序内实时展示为准），甲方可根据自身需求自主选择充值金额，充值金额一经支付，除本协议约定的可退款情形外，不予退还。</p>
      <p>3. 甲方应确保充值所用的支付账户（微信、支付宝等）为本人所有，且支付账户信息真实、有效、合法，若因支付账户异常、密码泄露、他人盗用等原因导致的充值损失，由甲方自行承担，乙方不承担任何责任。</p>
      <p>（三）充值到账与查询</p>
      <p>1. 甲方完成充值支付后，可通过小程序【我的】-【充值记录】查询充值金额、到账时间、充值状态等信息，乙方应保证充值记录的真实性、完整性，供甲方查询核对。2.
        若甲方发现充值支付成功但未到账，应在充值完成后24小时内通过小程序【我的】-【客服中心】联系乙方反馈，提供充值凭证、支付截图等相关证明材料，乙方将在3个工作日内核实处理，若确认未到账，将及时为甲方补冲到账；若核实已到账，将向甲方出具详细的到账记录说明。
      </p>
      <p>三、双方权利与义务</p>
      <p>（一）甲方权利与义务</p>
      <p>1. 甲方有权按照本协议约定，使用充值款项在乙方小程序内进行合法消费，有权查询自身充值记录、消费记录，有权对乙方的充值服务提出合理建议。</p>
      <p>2. 甲方应遵守本协议及乙方小程序的相关规则，不得利用充值服务从事任何违法违规行为，包括但不限于恶意刷充、套现、洗钱、传播违法信息等，若违反，乙方有权冻结甲方账号、没收充值款项，情节严重的，将追究甲方法律责任。</p>
      <p>3. 甲方应妥善保管自己的小程序账号、密码、支付账户等相关信息，不得泄露给第三方，若因自身保管不善导致账号被盗、充值款项被他人盗用，相关损失由甲方自行承担。</p>
      <p>4. 甲方确认，充值款项是其自有合法资金，若因资金来源非法导致的一切法律责任，由甲方自行承担，与乙方无关。</p>
      <p>5.
        若甲方为未成年人（未满18周岁），应在法定监护人的陪同下阅读本协议，在取得法定监护人同意后进行充值操作，未成年人充值的，其法定监护人应承担相应的监护责任；8周岁以下未成年人充值的，法定代理人可请求确认充值行为无效并要求返还充值款项（已消费部分除外）。
      </p>
      <p>（二）乙方权利与义务</p>
      <p>1. 乙方有权按照本协议约定，为甲方提供充值服务，有权对甲方的充值行为、账号使用情况进行监督，对违反本协议及相关规则的行为采取相应的管理措施（包括但不限于冻结账号、限制充值、没收充值款项等）。</p>
      <p>2. 乙方应保障小程序充值系统的正常运行，及时处理甲方反馈的充值相关问题，为甲方提供必要的咨询服务，客服响应时间参照小程序内公示的服务时限（工作日9:00-18:00）。</p>
      <p>3. 乙方应采取合理的技术措施和管理措施，保护甲方的个人信息、充值记录、消费记录等相关信息的安全，不得泄露、篡改、出售或非法提供给第三方，法律法规另有规定的除外。</p>
      <p>4. 乙方有权根据小程序运营需要，调整充值档位、支付渠道、充值规则等，但应提前3个工作日通过小程序公告、站内信等方式通知甲方，若甲方不同意调整，可选择停止充值，已充值款项可按照本协议约定继续使用。</p>
      <p>5. 乙方不得单方变更充值款项的使用范围、消费规则等实质性内容，若确需变更，应经甲方同意，否则变更内容对甲方不发生效力。</p>
      <p>四、充值款项的退款约定</p>
      <p>1. 除下列情形外，充值款项一经支付，不予退还： 甲方充值后，因乙方系统故障、服务中断等原因，导致甲方无法正常使用充值款项，且乙方无法在合理期限内修复的，甲方可申请退还未使用的充值款项；
        乙方终止小程序运营，无法继续提供充值及相关服务的，应提前7个工作日通知甲方，甲方可申请退还未使用的充值款项，乙方应在甲方申请后7个工作日内完成退款； 法律法规规定的其他可退款情形，或双方另有书面约定的。</p>
      <p>2.
        甲方申请退款时，应通过小程序【我的】-【客服中心】提交退款申请，提供相关证明材料（充值凭证、账号信息等），乙方将在3个工作日内核实，核实通过后，按照甲方充值时的支付渠道原路退还未使用的充值款项，退款到账时间以支付渠道到账时效为准。
      </p>
      <p>3. 若甲方已使用部分充值款项，退款金额为充值总金额减去已使用金额后的余额；若充值款项已全部使用，乙方不予退款。</p>
      <p>4. 甲方自充值之日起7日内，未使用充值款项且无违约行为的，可依据相关规定申请无理由退款，乙方应予以配合，已使用部分不予退还。</p>
      <p>五、违约责任</p>
    </div>
  </main>
</template>

<script setup>
</script>

<style scoped lang="less">
.vw(@number) {
  @return: calc(@number / 375 * 100vw);
}

.aggrement {
  height: 100vh;
  display: flex;
  flex-direction: column;

  .body {
    flex: 1;
    overflow-y: auto;
    overflow-x: hidden;
    background-color: var(--white--);
    padding: .vw(8)[] .vw(18)[];

    p {
      color: var(--light-text--);
      font-family: "PingFang SC";
      font-size: .vw(14)[];
      line-height: .vw(22)[];
      font-weight: 400;
      font-style: normal;

      &:not(:last-of-type) {
        margin-bottom: .vw(10)[];
      }
    }
  }
}
</style>